doc/20.機能設計/060_設計補足資料/外部システムからの受領/BPMSチーム/20151217受領/TaskESB-sampleRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tas="http://TargetNamespace.com/TaskEsbRS_Operation1_request">
   <soapenv:Header/>
   <soapenv:Body>
      <tas:taskEsbRequestMessage>
         <tas:sysId>SAP</tas:sysId>
         <tas:processId>SampleProcess</tas:processId>
         <tas:sourceSystemInfo>
            <tas:primaryKey>ExternalSystemPK</tas:primaryKey>
            <tas:primaryKeyValueforTaskNAVIDisplay>ExternalSystemPKVal</tas:primaryKeyValueforTaskNAVIDisplay>
            <tas:primaryKeyValueforSourceSystemRun>ExternalSystemPKVal</tas:primaryKeyValueforSourceSystemRun>
         </tas:sourceSystemInfo>
         <tas:taskProcessingType>string</tas:taskProcessingType>
         <tas:taskKind>string</tas:taskKind>
         <tas:taskKindDetail>string</tas:taskKindDetail>
         <tas:comment>string</tas:comment>
         <tas:attachedManagementInfo>
            <tas:documentId>string</tas:documentId>
            <tas:attachedLinkName>string</tas:attachedLinkName>
         </tas:attachedManagementInfo>
         <tas:updateUserId>string</tas:updateUserId>
         <tas:picUserId>string</tas:picUserId>
         <tas:picCompany>string</tas:picCompany>
         <tas:picDept>string</tas:picDept>
         <tas:issuanceDate>yyyy-MM-dd</tas:issuanceDate>
         <tas:followingSourceSystemInfo>
            <tas:primaryKey>string</tas:primaryKey>
            <tas:primaryKeyValueforTaskNAVIDisplay>string</tas:primaryKeyValueforTaskNAVIDisplay>
            <tas:primaryKeyValueforSourceSystemRun>string</tas:primaryKeyValueforSourceSystemRun>
         </tas:followingSourceSystemInfo>
         <tas:searchWord>string</tas:searchWord>
         <tas:urlInfo>
            <tas:displayName>string</tas:displayName>
            <tas:url>string</tas:url>
         </tas:urlInfo>
         <tas:emergencyFlag>string</tas:emergencyFlag>
         <tas:bundleFlag>string</tas:bundleFlag>
      </tas:taskEsbRequestMessage>
   </soapenv:Body>
</soapenv:Envelope>